[
    {
        "name": "Moon-Touched Sword",
        "slug": "moon-touched-sword",
        "rarity": "Common",
        "type": "Weapon",
        "desc": "In darkness, the unsheathed blade of this sword sheds moonlight, creating bright light in a 15-foot radius and dim light for an additional 15 feet."
    },
    {
        "name": "Ring of Winter",
        "rarity": "Artifact",
        "slug": "ring-of-winter",
        "type": "Wonderous item",
        "desc": ""
    },
    {
        "name": "Armblade",
        "rarity": "Common",
        "slug": "armblade",
        "type": "Weapon  (any one-handed melee weapon)",
        "desc": "An armblade is a magic weapon that attaches to your arm, becoming inseparable from you as long as you're attuned to it. To attune to this item, you must hold it against your forearm for the entire attunement period.</br></br>As a bonus action, you can retract the armblade into your forearm or extend it from there. While it is extended, you can use the weapon as if you were holding it, and you can't use that hand for other purposes."
    },
    {
        "name": "Armor of Gleaming",
        "rarity": "Common",
        "slug": "armor-of-gleaming",
        "type": "Armor (any medium or heavy)",
        "desc": "This armor never gets dirty."
    },
    {
        "name": "Boots of False Tracks",
        "rarity": "Common",
        "slug": "boots-of-false-tracks",
        "type": "Wonderous item",
        "desc": "Only humanoids can wear these boots. While wearing the boots, you can choose to have them leave tracks like those of another kind of humanoid of your size."
    },
    {
        "name": "Breathing Bubble",
        "rarity": "Common",
        "slug": "breathing-bubble",
        "type": "Wonderous item",
        "desc": "This translucent, bubble-like sphere has a slightly tacky outer surface, and you gain the item's benefits only while wearing it over your head like a helmet. </br></br>The bubble contains 1 hour of breathable air. The bubble regains all its expended air daily at dawn."
    },
    {
        "name": "Cloak of Billowing",
        "rarity": "Common",
        "slug": "cloak-of-billowing",
        "type": "Wonderous item",
        "desc": "While wearing this cloak, you can use a bonus action to make it billow dramatically."
    },
    {
        "name": "Clockwork Amulet",
        "rarity": "Common",
        "slug": "clockwork-amulet",
        "type": "Wonderous item",
        "desc": "This copper amulet contains tiny interlocking gears and is powered by magic from Mechanus, a plane of clockwork predictability. A creature that puts an ear to the amulet can hear faint ticking and whirring noises coming from within.</br></br>When you make an attack roll while wearing the amulet, you can forgo rolling the d20 to get a 10 on the die. Once used, this property can't be used again until the next dawn."
    }
]